app/controllers/runs_controller.rb

  def index
    Run.populate_runs
    @runs = Run.all
---
SELECT * FROM "runs" WHERE ("runs"."run_id" = 1615403977) LIMIT 1